In [20]:
#step 1: import necessary libraries
import numpy as np
import pandas as pd
import seaborn as snb
import matplotlib.pyplot as plt

In [21]:
#step 2 : Load data set

data = pd.read_csv("bse_data.csv")

#display first row of the dataframe
print(data.head(5))

   number_siblings                   name  gender  age living_allowance  \
0                1     Nakasujja Gertrude  female   33              NaN
1                3  Arinda Asiimwe Atweta  female   23           50,000
2                4    Ndjekornom Victoire    male   23           25,000
3                0         KATURAMU EDGAR    male   27          500,000
4                4      Abinsinguza Lasse    male   24          100,000

   have_bf_gf                profession  daily_meals
0           1            Data Scientist            2
1           1  Machine Learning Enginer            1
2           0            Data Scientist            1
3           0  Machine Learning Enginer            2
4           1            Data Scientist            2

In [22]:
# Step3: Data cleaning and pre-processing
"""
Things to look out for in data cleaning and pre-processing
1. Incosistent data types
2. Wrong data format
3. Duplicates
4. Missing values

"""
# 1. Check for incosistent data types
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 36 entries, 0 to 35
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   number_siblings   36 non-null     int64
 1   name              36 non-null     object
 2   gender            36 non-null     object
 3   age               36 non-null     int64
 4   living_allowance  29 non-null     object
 5   have_bf_gf        36 non-null     int64
 6   profession        36 non-null     object
 7   daily_meals       36 non-null     int64
dtypes: int64(4), object(4)
memory usage: 2.4+ KB
None

In [23]:
# From the output above, all the values in the columns have similar data types depending on the column meaning
# there is no incosistent data type

# 2. Check for Wrong data format and solve it
# Depending on the output above, column living_allowance is of type string(object) yet it is supposed to be in  
# numeric format preferably float format for proper calculations.


# Convert living_allowance into a float format
# data["living_allowance"] = pd.to_numeric(data["living_allowance"], errors = "coerce").astype(float)

# We replace the comma first because if we dont, an error occurs as we convert the string (living_allowance ) to float, hence the 
# errors ="coerce" changes everything to NaN which we dont want because that is losing data to work with.

data["living_allowance"] = data["living_allowance"].replace([","], "", regex=True).astype(float)

#check if it worked
print(data.dtypes)

number_siblings       int64
name                 object
gender               object
age                   int64
living_allowance    float64
have_bf_gf            int64
profession           object
daily_meals           int64
dtype: object

In [25]:
# From the output above, we can see that living_allowance is now in float format
# Lets inspect our data again to see how it looks like

print(data)

    number_siblings                       name  gender  age  living_allowance  \
0                 1         Nakasujja Gertrude  female   33               NaN
1                 3      Arinda Asiimwe Atweta  female   23           50000.0
2                 4        Ndjekornom Victoire    male   23           25000.0
3                 0             KATURAMU EDGAR    male   27          500000.0
4                 4          Abinsinguza Lasse    male   24          100000.0
5                 4        Beingana Jim Junior    male   20           10000.0
6                 6   Cyiza Ndoli Jean de Dieu    male   23           60000.0
7                 8        MUSIIMENTA CISSYLYN  female   20          260000.0
8                 2           Nakanwagu Vanesa  female   23          250000.0
9                 9                Otim Ronald    male   25               NaN
10                1                  Levi Aine    male   24         1000000.0
11                1              NASAAZI TAKIA  female   23            2000.0
12                5                      Alvin    male   23         2500000.0
13                3            MULINDWA YUSUF     male   22               NaN
14                2                     Hillal    male   32          150000.0
15                9           mpairwe   lauben    male   26          760000.0
16                4               Lutalo Allan    male   24          200000.0
17                2                Efrata Aron  female   22          200000.0
18                4                David Hope     male   22           35000.0
19                1             ntegeka k pius    male   30          700000.0
20                4            Yapyeko Rebecca  female   24          500000.0
21                7      NKETAMUKAMA TARASISIO    male   22          600000.0
22                3    Ampaire Stacey Nuwagaba  female   22          300000.0
23                5            Ahaabwe Derrick    male   22          200000.0
24                0           Ssentongo Henry     male   27               NaN
25                6                     Shadia  female   23           20000.0
26                4                     Harlan    male   24          250000.0
27                1              AMADILE MAJID    male   23               NaN
28                8                Nankya Elsa  female   23          120000.0
29                2         Asiimire Patricia   female   22         1000000.0
30                2           Rwakasiisi Edwin    male   24          150000.0
31                5            Ampumuza Aijuka  female   23          500000.0
32                5         TUKWASIIBWE MARTIN    male   23          200000.0
33                8       Olowo Omondi Philly     male   23               NaN
34                4  Kisembo Rodgers Bangirana    male   23          300000.0
35                3           NIWAMANYA JAMES     male   29               NaN

    have_bf_gf                profession  daily_meals
0            1            Data Scientist            2
1            1  Machine Learning Enginer            1
2            0            Data Scientist            1
3            0  Machine Learning Enginer            2
4            1            Data Scientist            2
5            0            Data Scientist            3
6            0              Data Analyst            2
7            0  Machine Learning Enginer            3
8            1            Data Scientist            3
9            0            Data Scientist            2
10           0            Data Scientist            3
11           0              Data Analyst            1
12           1  Machine Learning Enginer            3
13           0            Data Scientist            3
14           0  Machine Learning Enginer            2
15           1  Machine Learning Enginer            3
16           1            Data Scientist            3
17           1              Data Analyst            2
18           0  Machine Learning Enginer            3
19           0            Data Scientist            3
20           0            Data Scientist            3
21           0  Machine Learning Enginer            2
22           0              Data Analyst            2
23           0            Data Scientist            2
24           0  Machine Learning Enginer            1
25           0            Data Scientist            2
26           0            Data Scientist            3
27           0              Data Analyst            2
28           1            Data Scientist            2
29           0            Data Scientist            3
30           1            Data Scientist            3
31           0            Data Scientist            2
32           0              Data Analyst            2
33           1            Data Scientist            2
34           0              Data Analyst            3
35           1  Machine Learning Enginer            1

In [26]:
#3. Check for duplicates and drop them if any exists
duplicates = data.duplicated()
print(f"Duplicated rows: {duplicates}")

Duplicated rows: 0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
dtype: bool

In [27]:
# Show the number of duplicated rows
number_of_dupicates = data.duplicated().sum()
print(f"Number of duplicated rows : {number_of_dupicates}")

Number of duplicated rows : 0

In [29]:
# now that we have seen that we have no duplicates, we go to the last check
# 4. Check for missing values

missing_values = data.isnull() #have an overview
print(missing_values)

    number_siblings   name  gender    age  living_allowance  have_bf_gf  \
0             False  False   False  False              True       False
1             False  False   False  False             False       False
2             False  False   False  False             False       False
3             False  False   False  False             False       False
4             False  False   False  False             False       False
5             False  False   False  False             False       False
6             False  False   False  False             False       False
7             False  False   False  False             False       False
8             False  False   False  False             False       False
9             False  False   False  False              True       False
10            False  False   False  False             False       False
11            False  False   False  False             False       False
12            False  False   False  False             False       False
13            False  False   False  False              True       False
14            False  False   False  False             False       False
15            False  False   False  False             False       False
16            False  False   False  False             False       False
17            False  False   False  False             False       False
18            False  False   False  False             False       False
19            False  False   False  False             False       False
20            False  False   False  False             False       False
21            False  False   False  False             False       False
22            False  False   False  False             False       False
23            False  False   False  False             False       False
24            False  False   False  False              True       False
25            False  False   False  False             False       False
26            False  False   False  False             False       False
27            False  False   False  False              True       False
28            False  False   False  False             False       False
29            False  False   False  False             False       False
30            False  False   False  False             False       False
31            False  False   False  False             False       False
32            False  False   False  False             False       False
33            False  False   False  False              True       False
34            False  False   False  False             False       False
35            False  False   False  False              True       False

    profession  daily_meals
0        False        False
1        False        False
2        False        False
3        False        False
4        False        False
5        False        False
6        False        False
7        False        False
8        False        False
9        False        False
10       False        False
11       False        False
12       False        False
13       False        False
14       False        False
15       False        False
16       False        False
17       False        False
18       False        False
19       False        False
20       False        False
21       False        False
22       False        False
23       False        False
24       False        False
25       False        False
26       False        False
27       False        False
28       False        False
29       False        False
30       False        False
31       False        False
32       False        False
33       False        False
34       False        False
35       False        False

In [30]:

# check for missing values in a summerised way
number_of_missing_values = data.isnull().sum()
print(number_of_missing_values)

number_siblings     0
name                0
gender              0
age                 0
living_allowance    7
have_bf_gf          0
profession          0
daily_meals         0
dtype: int64

In [31]:
# From the output above, we can see that only the living_allowance column has missing values and we are going to fill them from here.

# Fill the missing values in living_allowances, with the average or mean value of the living allowance.

data["living_allowance"] = data["living_allowance"].fillna(data["living_allowance"].mean())

# see if it worked
print(data)

    number_siblings                       name  gender  age  living_allowance  \
0                 1         Nakasujja Gertrude  female   33      3.773103e+05
1                 3      Arinda Asiimwe Atweta  female   23      5.000000e+04
2                 4        Ndjekornom Victoire    male   23      2.500000e+04
3                 0             KATURAMU EDGAR    male   27      5.000000e+05
4                 4          Abinsinguza Lasse    male   24      1.000000e+05
5                 4        Beingana Jim Junior    male   20      1.000000e+04
6                 6   Cyiza Ndoli Jean de Dieu    male   23      6.000000e+04
7                 8        MUSIIMENTA CISSYLYN  female   20      2.600000e+05
8                 2           Nakanwagu Vanesa  female   23      2.500000e+05
9                 9                Otim Ronald    male   25      3.773103e+05
10                1                  Levi Aine    male   24      1.000000e+06
11                1              NASAAZI TAKIA  female   23      2.000000e+03
12                5                      Alvin    male   23      2.500000e+06
13                3            MULINDWA YUSUF     male   22      3.773103e+05
14                2                     Hillal    male   32      1.500000e+05
15                9           mpairwe   lauben    male   26      7.600000e+05
16                4               Lutalo Allan    male   24      2.000000e+05
17                2                Efrata Aron  female   22      2.000000e+05
18                4                David Hope     male   22      3.500000e+04
19                1             ntegeka k pius    male   30      7.000000e+05
20                4            Yapyeko Rebecca  female   24      5.000000e+05
21                7      NKETAMUKAMA TARASISIO    male   22      6.000000e+05
22                3    Ampaire Stacey Nuwagaba  female   22      3.000000e+05
23                5            Ahaabwe Derrick    male   22      2.000000e+05
24                0           Ssentongo Henry     male   27      3.773103e+05
25                6                     Shadia  female   23      2.000000e+04
26                4                     Harlan    male   24      2.500000e+05
27                1              AMADILE MAJID    male   23      3.773103e+05
28                8                Nankya Elsa  female   23      1.200000e+05
29                2         Asiimire Patricia   female   22      1.000000e+06
30                2           Rwakasiisi Edwin    male   24      1.500000e+05
31                5            Ampumuza Aijuka  female   23      5.000000e+05
32                5         TUKWASIIBWE MARTIN    male   23      2.000000e+05
33                8       Olowo Omondi Philly     male   23      3.773103e+05
34                4  Kisembo Rodgers Bangirana    male   23      3.000000e+05
35                3           NIWAMANYA JAMES     male   29      3.773103e+05

    have_bf_gf                profession  daily_meals
0            1            Data Scientist            2
1            1  Machine Learning Enginer            1
2            0            Data Scientist            1
3            0  Machine Learning Enginer            2
4            1            Data Scientist            2
5            0            Data Scientist            3
6            0              Data Analyst            2
7            0  Machine Learning Enginer            3
8            1            Data Scientist            3
9            0            Data Scientist            2
10           0            Data Scientist            3
11           0              Data Analyst            1
12           1  Machine Learning Enginer            3
13           0            Data Scientist            3
14           0  Machine Learning Enginer            2
15           1  Machine Learning Enginer            3
16           1            Data Scientist            3
17           1              Data Analyst            2
18           0  Machine Learning Enginer            3
19           0            Data Scientist            3
20           0            Data Scientist            3
21           0  Machine Learning Enginer            2
22           0              Data Analyst            2
23           0            Data Scientist            2
24           0  Machine Learning Enginer            1
25           0            Data Scientist            2
26           0            Data Scientist            3
27           0              Data Analyst            2
28           1            Data Scientist            2
29           0            Data Scientist            3
30           1            Data Scientist            3
31           0            Data Scientist            2
32           0              Data Analyst            2
33           1            Data Scientist            2
34           0              Data Analyst            3
35           1  Machine Learning Enginer            1